# DefaultConstructionMassGlazing Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DefaultConstructionMassGlazing Property
ParameterTypeId Class See Also
---
"Mass Glazing"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DefaultConstructionMassGlazing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DefaultConstructionMassGlazing As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DefaultConstructionMassGlazing {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace